# Creación e inspección de Dataframes.

1. Crear un objeto de la clase DataFrame.

In [50]:
import pandas as pd

data = {
    'Nombre': ['Ana', 'Luis'],
    'Edad': [23, 34],
    'Ciudad': ['Valencia', 'Sevilla']
}

df = pd.DataFrame(data)
print(df)

  Nombre  Edad    Ciudad
0    Ana    23  Valencia
1   Luis    34   Sevilla

2. Leer un archivo CSV con la función read_csv para crear un DataFrame.

In [ ]:
df = pd.read_csv('datos.csv')
print(df.head())

3. Guardar los registros de un DataFrame en un archivo de formato CSV.

In [52]:
df.to_csv('ej3.csv', index=False)

4. Obtener las primeras n filas de un objeto DataFrame.

In [53]:
dataej4 = {
    'Nombre': ['Nike', 'Adidas', 'Puma','Jordan'],
    'Empleados': [2300, 340, 150,6000]
}

df = pd.DataFrame(dataej4)
n = 3  
print(df.head(n))

   Nombre  Empleados
0    Nike       2300
1  Adidas        340
2    Puma        150

5. Obtener las últimas n filas de un objeto DataFrame.

In [54]:
print(df.tail(n))

   Nombre  Empleados
1  Adidas        340
2    Puma        150
3  Jordan       6000

6. Obtener los nombres de las filas y las columnas de un DataFrame.

In [55]:
nombres_filas = df.index = (['Empresa1', 'Empresa2', 'Empresa3','Empresa4'])
print("Nombres de las filas:", nombres_filas)


nombres_columnas = df.columns
print("Nombres de las columnas:", nombres_columnas)

Nombres de las filas: ['Empresa1', 'Empresa2', 'Empresa3', 'Empresa4']
Nombres de las columnas: Index(['Nombre', 'Empleados'], dtype='object')

7. Obtener como una lista Python los nombres de las columnas de un DataFrame.

In [56]:
lista_nombres_columnas = list(nombres_columnas)
print("Lista de nombres de las columnas:", lista_nombres_columnas)

Lista de nombres de las columnas: ['Nombre', 'Empleados']

8. Renombrar las columnas de un objeto DataFrame.
9. Renombrar una columna de un DataFrame con la función rename.

In [57]:
df_renamed = df.rename(columns={'Nombre': 'Marca', 'Empleados': 'Cantidad_Empleados'})
print(df_renamed)

           Marca  Cantidad_Empleados
Empresa1    Nike                2300
Empresa2  Adidas                 340
Empresa3    Puma                 150
Empresa4  Jordan                6000

In [58]:
df.columns = ['Marca', 'Cantidad_Empleados']
print(df)

           Marca  Cantidad_Empleados
Empresa1    Nike                2300
Empresa2  Adidas                 340
Empresa3    Puma                 150
Empresa4  Jordan                6000

10. Obtener los tipos de datos de las columnas de un DataFrame.

In [59]:
tipos_datos = df.dtypes
print("Tipos de datos de las columnas:\n", tipos_datos)

Tipos de datos de las columnas:
 Marca                 object
Cantidad_Empleados     int64
dtype: object

11. Mostrar un reporte con la información básica de un objeto DataFrame.

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Empresa1 to Empresa4
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Marca               4 non-null      object
 1   Cantidad_Empleados  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 96.0+ bytes

12. Obtener estadísticas básicas en un objeto DataFrame con la función describe.

In [61]:
estadisticas_basicas = df.describe()
print("Estadísticas básicas del DataFrame:\n", estadisticas_basicas)

Estadísticas básicas del DataFrame:
        Cantidad_Empleados
count            4.000000
mean          2197.500000
std           2714.901778
min            150.000000
25%            292.500000
50%           1320.000000
75%           3225.000000
max           6000.000000

13. Obtener las columnas de un determinado tipo de dato con select_dtypes.

In [62]:
columnas_numericas = df.select_dtypes(include=['number'])
print("Columnas numéricas:\n", columnas_numericas)

columna_objeto = df.select_dtypes(include=['object'])
print("Columnas de tipo objeto:\n", columna_objeto)

Columnas numéricas:
           Cantidad_Empleados
Empresa1                2300
Empresa2                 340
Empresa3                 150
Empresa4                6000
Columnas de tipo objeto:
            Marca
Empresa1    Nike
Empresa2  Adidas
Empresa3    Puma
Empresa4  Jordan

14. Cambiar el tipo de dato de una o más columnas con astype.

In [63]:
df_renamed['Cantidad_Empleados'].astype(float)
print(df_renamed.dtypes)
df_renamed

Marca                 object
Cantidad_Empleados     int64
dtype: object

           Marca  Cantidad_Empleados
Empresa1    Nike                2300
Empresa2  Adidas                 340
Empresa3    Puma                 150
Empresa4  Jordan                6000

15. Obtener la dimensión, el tamaño, y la forma de un objeto DataFrame.

In [64]:
dimension = df_renamed.ndim
tamaño = df_renamed.size
forma = df_renamed.shape

print("Dimensión del DataFrame:", dimension)
print("Tamaño del DataFrame:", tamaño)
print("Forma del DataFrame:", forma)

Dimensión del DataFrame: 2
Tamaño del DataFrame: 8
Forma del DataFrame: (4, 2)

16. Obtener la cantidad de memoria ocupada por cada columna en un DataFrame.

In [65]:
memoria_ocupada = df_renamed.memory_usage(deep=True)
print("Cantidad de memoria ocupada por cada columna:\n", memoria_ocupada)

Cantidad de memoria ocupada por cada columna:
 Index                 228
Marca                 216
Cantidad_Empleados     32
dtype: int64

17. Comprobar si un objeto DataFrame está vacío con empty.

In [66]:
vacio = df_renamed.empty
print("¿Está vacío el dataframe df_renamed?:", vacio)

¿Está vacío el dataframe df_renamed?: False

18. Obtener los datos de una columna como una lista Python con tolist.

In [67]:
lista = df_renamed['Marca'].tolist()
lista

['Nike', 'Adidas', 'Puma', 'Jordan']

19. Encontrar la cantidad de elementos únicos por cada fila y columna con nunique.

In [68]:
elem_unicos_columna = df_renamed.nunique()
print("Número de elementos únicos por columna:\n", elem_unicos_columna)

elem_unicos_fila = df_renamed.apply(pd.Series.nunique, axis=1)
print("Número de elementos únicos por fila:\n", elem_unicos_fila)

Número de elementos únicos por columna:
 Marca                 4
Cantidad_Empleados    4
dtype: int64
Número de elementos únicos por fila:
 Empresa1    2
Empresa2    2
Empresa3    2
Empresa4    2
dtype: int64

20. Obtener los elementos distintos de una columna de un DataFrame con unique.

In [69]:
elementos_unicos = df_renamed['Marca'].unique()
print("Elementos únicos en la columna 'Marca':", elementos_unicos)

Elementos únicos en la columna 'Marca': ['Nike' 'Adidas' 'Puma' 'Jordan']

21. Obtener los tipos de datos de las columnas de un DataFrame con dtypes.

In [70]:
tipos_datos = df_renamed.dtypes
print("Tipos de datos de las columnas:\n", tipos_datos)

Tipos de datos de las columnas:
 Marca                 object
Cantidad_Empleados     int64
dtype: object

22. Cambiar el tipo de una columna de float a int con la función astype.

In [71]:
df_renamed['Cantidad_Empleados'] = df_renamed['Cantidad_Empleados'].astype(int)
print(df_renamed.dtypes)
df_renamed

Marca                 object
Cantidad_Empleados     int64
dtype: object

           Marca  Cantidad_Empleados
Empresa1    Nike                2300
Empresa2  Adidas                 340
Empresa3    Puma                 150
Empresa4  Jordan                6000

23. Calcular el número de tipos de datos por cada categoría con get_dtype_counts.

In [72]:
tipo_datos = df_renamed.dtypes.value_counts()
print("Número de tipos de datos por categoría:\n", tipo_datos)

Número de tipos de datos por categoría:
 object    1
int64     1
Name: count, dtype: int64

24. Contar el número de columnas que tiene un DataFrame.

In [73]:
num_colum = df_renamed.shape[1]
print("Número de columnas en el DataFrame:", num_colum)

Número de columnas en el DataFrame: 2

25. Obtener la representación en NumPy de un objeto DataFrame.

In [74]:
numpy = df_renamed.to_numpy()
print("Representación en NumPy del DataFrame:\n", numpy)

Representación en NumPy del DataFrame:
 [['Nike' 2300]
 ['Adidas' 340]
 ['Puma' 150]
 ['Jordan' 6000]]

26. Crear un objeto DataFrame a partir de objetos Series.

In [75]:
series_marca = pd.Series(['Nike', 'Adidas', 'Puma', 'Jordan'], index=['Empresa1', 'Empresa2', 'Empresa3', 'Empresa4'])
series_empleados = pd.Series([2300, 340, 150, 6000], index=['Empresa1', 'Empresa2', 'Empresa3', 'Empresa4'])

df_series = pd.DataFrame({'Marca': series_marca, 'Cantidad_Empleados': series_empleados})
df_series

           Marca  Cantidad_Empleados
Empresa1    Nike                2300
Empresa2  Adidas                 340
Empresa3    Puma                 150
Empresa4  Jordan                6000

# Selección de datos y modificación de Dataframes

27. Extraer una fila de un DataFrame como un objeto Series.

In [76]:
fila_empresa1 = df_renamed.loc['Empresa1']
fila_empresa1

Marca                 Nike
Cantidad_Empleados    2300
Name: Empresa1, dtype: object

28. Cambiar el orden de dos columnas de un objeto DataFrame.

In [77]:
df_reordered = df_renamed[['Cantidad_Empleados', 'Marca']]
print(df_reordered)

          Cantidad_Empleados   Marca
Empresa1                2300    Nike
Empresa2                 340  Adidas
Empresa3                 150    Puma
Empresa4                6000  Jordan

29. Crea un DataFrame a partir de uno existente tomando alguna de las columnas del DataFrame  existente.

In [78]:
df_nuevo = df_renamed[['Marca']].copy()

df_nuevo['Ciudad'] = ['Los Palacios', 'Lora del rio', 'Marchena', 'Tenerife']
df_nuevo['Fundacion'] = [1964, 1949, 1948, 1984]

df_nuevo

           Marca        Ciudad  Fundacion
Empresa1    Nike  Los Palacios       1964
Empresa2  Adidas  Lora del rio       1949
Empresa3    Puma      Marchena       1948
Empresa4  Jordan      Tenerife       1984

30. Seleccionar todas las columnas de un DataFrame, excepto una en particular.

In [79]:
df_except = df_nuevo.drop(columns=['Fundacion'])
df_except

           Marca        Ciudad
Empresa1    Nike  Los Palacios
Empresa2  Adidas  Lora del rio
Empresa3    Puma      Marchena
Empresa4  Jordan      Tenerife

31. Seleccionar columnas de un objeto DataFrame usando notación de slicing.

In [80]:
df_ej31 = df_nuevo.iloc[:, :2]
print(df_ej31)

           Marca        Ciudad
Empresa1    Nike  Los Palacios
Empresa2  Adidas  Lora del rio
Empresa3    Puma      Marchena
Empresa4  Jordan      Tenerife

32. Comprobar si una columna existe en un DataFrame con el operador Python in.

In [81]:
comprobacion = 'Ciudad'
existe_columna = comprobacion in df_nuevo.columns
print(f"¿Existe la columna '{comprobacion}' en el DataFrame?: {existe_columna}")

¿Existe la columna 'Ciudad' en el DataFrame?: True

33. Validar con isin si un elemento se halla dentro de un DataFrame.

In [82]:
elem_validar = 'Nike'
resultado = df_nuevo['Marca'].isin([elem_validar])
print(f"¿Se encuentra el elemento '{elem_validar}' en el DataFrame?: {resultado.any()}")

¿Se encuentra el elemento 'Nike' en el DataFrame?: True

34. Obtener registros a partir de sus índices numéricos con iloc.

In [83]:
primer_registro = df_nuevo.iloc[0]
print("Primer registro:\n", primer_registro)

ultimo_registro = df_nuevo.iloc[-1]
print("Último registro:\n", ultimo_registro)

Primer registro:
 Marca                Nike
Ciudad       Los Palacios
Fundacion            1964
Name: Empresa1, dtype: object
Último registro:
 Marca          Jordan
Ciudad       Tenerife
Fundacion        1984
Name: Empresa4, dtype: object

35. Seleccionar filas y columnas específicas de un DataFrame con iloc.

In [84]:
filas_columnas_iloc = df_nuevo.iloc[[0,2], [0,1]]
filas_columnas_iloc

         Marca        Ciudad
Empresa1  Nike  Los Palacios
Empresa3  Puma      Marchena

36. Seleccionar filas y columnas a partir de sus nombres con loc.

In [85]:
filas_columnas_loc = df_nuevo.loc[['Empresa1', 'Empresa3'], ['Marca', 'Ciudad']]
filas_columnas_loc

         Marca        Ciudad
Empresa1  Nike  Los Palacios
Empresa3  Puma      Marchena

37. Seleccionar registros donde los valores de una columna estén en un rango.

In [86]:
rango_min = 280
rango_max = 3000

registros = df_renamed[(df_renamed['Cantidad_Empleados'] >= rango_min) & (df_renamed['Cantidad_Empleados'] <= rango_max)]
registros

           Marca  Cantidad_Empleados
Empresa1    Nike                2300
Empresa2  Adidas                 340

38 Seleccionar registros donde se cumpla una condición para valores de una columna.

In [87]:
condicion = 'Marchena'
registros_condicion = df_nuevo[df_nuevo['Ciudad'] == condicion]
registros_condicion

         Marca    Ciudad  Fundacion
Empresa3  Puma  Marchena       1948

39. Modificar un valor o entrada específico de un objeto DataFrame usando loc.

In [88]:
df_nuevo.loc['Empresa3', 'Marca'] = 'Reebok'

df_nuevo

           Marca        Ciudad  Fundacion
Empresa1    Nike  Los Palacios       1964
Empresa2  Adidas  Lora del rio       1949
Empresa3  Reebok      Marchena       1948
Empresa4  Jordan      Tenerife       1984

40. Insertar una nueva columna en una posición arbitraria con la función insert.

In [89]:
df_nuevo.insert(1, 'CEO', ['Pepe', 'Fernando', 'Maria', 'Sara'])

In [90]:
df_nuevo

           Marca       CEO        Ciudad  Fundacion
Empresa1    Nike      Pepe  Los Palacios       1964
Empresa2  Adidas  Fernando  Lora del rio       1949
Empresa3  Reebok     Maria      Marchena       1948
Empresa4  Jordan      Sara      Tenerife       1984

41. Agregar una nueva fila a un objeto DataFrame por medio de loc.

In [91]:
df_nuevo.loc['Empresa5'] = ['UnderGround', 'Adolfo', 'Las 3000', 1996]
df_nuevo

                Marca       CEO        Ciudad  Fundacion
Empresa1         Nike      Pepe  Los Palacios       1964
Empresa2       Adidas  Fernando  Lora del rio       1949
Empresa3       Reebok     Maria      Marchena       1948
Empresa4       Jordan      Sara      Tenerife       1984
Empresa5  UnderGround    Adolfo      Las 3000       1996

42. Recorrer cada una de las columnas de un objeto DataFrame con items.

In [92]:
for column_name, column_data in df_nuevo.items():
    print(f"Nombre de la columna: {column_name}")
    print(f"Datos de la columna:\n{column_data}\n")

Nombre de la columna: Marca
Datos de la columna:
Empresa1           Nike
Empresa2         Adidas
Empresa3         Reebok
Empresa4         Jordan
Empresa5    UnderGround
Name: Marca, dtype: object

Nombre de la columna: CEO
Datos de la columna:
Empresa1        Pepe
Empresa2    Fernando
Empresa3       Maria
Empresa4        Sara
Empresa5      Adolfo
Name: CEO, dtype: object

Nombre de la columna: Ciudad
Datos de la columna:
Empresa1    Los Palacios
Empresa2    Lora del rio
Empresa3        Marchena
Empresa4        Tenerife
Empresa5        Las 3000
Name: Ciudad, dtype: object

Nombre de la columna: Fundacion
Datos de la columna:
Empresa1    1964
Empresa2    1949
Empresa3    1948
Empresa4    1984
Empresa5    1996
Name: Fundacion, dtype: int64

43. Agregar una columna en una posición específica con la función DataFrame.insert.

In [93]:
df_nuevo.insert(2, 'País', ['España', 'España', 'España', 'España', 'España'])
df_nuevo

                Marca       CEO    País        Ciudad  Fundacion
Empresa1         Nike      Pepe  España  Los Palacios       1964
Empresa2       Adidas  Fernando  España  Lora del rio       1949
Empresa3       Reebok     Maria  España      Marchena       1948
Empresa4       Jordan      Sara  España      Tenerife       1984
Empresa5  UnderGround    Adolfo  España      Las 3000       1996

44. Agregar una nueva fila a una DataFrame con el método append.

In [94]:
nueva_fila = pd.DataFrame([{'Marca': 'Tiktok', 'CEO': 'LolaLolita', 'País': 'España', 'Ciudad': 'Madrid', 'Fundacion': 2019}])
df_nuevo = pd.concat([df_nuevo, nueva_fila], ignore_index=True)
df_nuevo

#Con el append no se podria hacer ya que esta fuera de esta versiond de Panda

         Marca         CEO    País        Ciudad  Fundacion
0         Nike        Pepe  España  Los Palacios       1964
1       Adidas    Fernando  España  Lora del rio       1949
2       Reebok       Maria  España      Marchena       1948
3       Jordan        Sara  España      Tenerife       1984
4  UnderGround      Adolfo  España      Las 3000       1996
5       Tiktok  LolaLolita  España        Madrid       2019

45. Eliminar una fila de un DataFrame con la función drop.

In [95]:
df_nuevo = df_nuevo.drop(index=5)
df_nuevo

         Marca       CEO    País        Ciudad  Fundacion
0         Nike      Pepe  España  Los Palacios       1964
1       Adidas  Fernando  España  Lora del rio       1949
2       Reebok     Maria  España      Marchena       1948
3       Jordan      Sara  España      Tenerife       1984
4  UnderGround    Adolfo  España      Las 3000       1996

46. Extraer y remover una columna por su nombre a través de la función pop.

In [96]:
colum_rem = df_nuevo.pop('CEO')
print("Columna removida:\n", colum_rem)
print("DataFrame después de remover la columna 'CEO':\n", df_nuevo)

Columna removida:
 0        Pepe
1    Fernando
2       Maria
3        Sara
4      Adolfo
Name: CEO, dtype: object
DataFrame después de remover la columna 'CEO':
          Marca    País        Ciudad  Fundacion
0         Nike  España  Los Palacios       1964
1       Adidas  España  Lora del rio       1949
2       Reebok  España      Marchena       1948
3       Jordan  España      Tenerife       1984
4  UnderGround  España      Las 3000       1996

47. Reemplazar valores de una columna por medio de la función replace.

In [97]:
df_nuevo['Marca'] = df_nuevo['Marca'].replace({'Reebok': 'NewBalance'})
df_nuevo

         Marca    País        Ciudad  Fundacion
0         Nike  España  Los Palacios       1964
1       Adidas  España  Lora del rio       1949
2   NewBalance  España      Marchena       1948
3       Jordan  España      Tenerife       1984
4  UnderGround  España      Las 3000       1996

48. Reemplazar valores que no cumplan una condición a través de la función DataFrame.where.

In [ ]:
df_renamed['Cantidad_Empleados'] = df_renamed['Cantidad_Empleados'].where(df_renamed['Cantidad_Empleados'] > 1000, other=50)
df_renamed

           Marca  Cantidad_Empleados
Empresa1    Nike                2300
Empresa2  Adidas                  50
Empresa3    Puma                  50
Empresa4  Jordan                6000

49. Agregar una nueva fila a un DataFrame con notación de slicing.

In [99]:
df_nuevo.loc[len(df_nuevo)] = ['Reebok', 'España', 'Madrid', 2021]
df_nuevo

         Marca    País        Ciudad  Fundacion
0         Nike  España  Los Palacios       1964
1       Adidas  España  Lora del rio       1949
2   NewBalance  España      Marchena       1948
3       Jordan  España      Tenerife       1984
4  UnderGround  España      Las 3000       1996
5       Reebok  España        Madrid       2021

50. Usar la función mask para modificar los valores que cumplan una condición.

In [100]:
df_renamed['Cantidad_Empleados'] = df_renamed['Cantidad_Empleados'].mask(df_renamed['Cantidad_Empleados'] < 1000, other=1000)
df_renamed

           Marca  Cantidad_Empleados
Empresa1    Nike                2300
Empresa2  Adidas                1000
Empresa3    Puma                1000
Empresa4  Jordan                6000

51. Iterar cada una de las filas de un DataFrame con la función iterrows.

In [101]:
for index, row in df_nuevo.iterrows():
    print(f"Índice: {index}")
    print(f"Fila:\n{row}\n")

Índice: 0
Fila:
Marca                Nike
País               España
Ciudad       Los Palacios
Fundacion            1964
Name: 0, dtype: object

Índice: 1
Fila:
Marca              Adidas
País               España
Ciudad       Lora del rio
Fundacion            1949
Name: 1, dtype: object

Índice: 2
Fila:
Marca        NewBalance
País             España
Ciudad         Marchena
Fundacion          1948
Name: 2, dtype: object

Índice: 3
Fila:
Marca          Jordan
País           España
Ciudad       Tenerife
Fundacion        1984
Name: 3, dtype: object

Índice: 4
Fila:
Marca        UnderGround
País              España
Ciudad          Las 3000
Fundacion           1996
Name: 4, dtype: object

Índice: 5
Fila:
Marca        Reebok
País         España
Ciudad       Madrid
Fundacion      2021
Name: 5, dtype: object

52. Eliminar filas o registros con la función DataFrame.drop.

In [102]:
df_nuevo = df_nuevo.drop(index=5)
df_nuevo

         Marca    País        Ciudad  Fundacion
0         Nike  España  Los Palacios       1964
1       Adidas  España  Lora del rio       1949
2   NewBalance  España      Marchena       1948
3       Jordan  España      Tenerife       1984
4  UnderGround  España      Las 3000       1996

In [103]:
df_nuevo

         Marca    País        Ciudad  Fundacion
0         Nike  España  Los Palacios       1964
1       Adidas  España  Lora del rio       1949
2   NewBalance  España      Marchena       1948
3       Jordan  España      Tenerife       1984
4  UnderGround  España      Las 3000       1996

53. Combinar dos objetos DataFrame con la función concat.

In [104]:
df_combined = pd.concat([df_renamed, df_nuevo], axis=0)
df_combined

                Marca  Cantidad_Empleados    País        Ciudad  Fundacion
Empresa1         Nike              2300.0     NaN           NaN        NaN
Empresa2       Adidas              1000.0     NaN           NaN        NaN
Empresa3         Puma              1000.0     NaN           NaN        NaN
Empresa4       Jordan              6000.0     NaN           NaN        NaN
0                Nike                 NaN  España  Los Palacios     1964.0
1              Adidas                 NaN  España  Lora del rio     1949.0
2          NewBalance                 NaN  España      Marchena     1948.0
3              Jordan                 NaN  España      Tenerife     1984.0
4         UnderGround                 NaN  España      Las 3000     1996.0

54. Combinar dos objetos DataFrame con la función merge.

In [105]:
df_merged = pd.merge(df_renamed, df_nuevo, on='Marca', how='inner')
df_merged

    Marca  Cantidad_Empleados    País        Ciudad  Fundacion
0    Nike                2300  España  Los Palacios       1964
1  Adidas                1000  España  Lora del rio       1949
2  Jordan                6000  España      Tenerife       1984

55. Eliminar registros duplicados de un DataFrame a partir de una columna.

In [106]:
df_sin_duplicados = df_combined.drop_duplicates(subset='Marca')
df_sin_duplicados

                Marca  Cantidad_Empleados    País    Ciudad  Fundacion
Empresa1         Nike              2300.0     NaN       NaN        NaN
Empresa2       Adidas              1000.0     NaN       NaN        NaN
Empresa3         Puma              1000.0     NaN       NaN        NaN
Empresa4       Jordan              6000.0     NaN       NaN        NaN
2          NewBalance                 NaN  España  Marchena     1948.0
4         UnderGround                 NaN  España  Las 3000     1996.0

56. Cambiar el orden de las filas de forma aleatoria con la función sample.

In [107]:
df_random = df_sin_duplicados.sample(frac=1).reset_index(drop=True)
df_random

         Marca  Cantidad_Empleados    País    Ciudad  Fundacion
0  UnderGround                 NaN  España  Las 3000     1996.0
1       Adidas              1000.0     NaN       NaN        NaN
2   NewBalance                 NaN  España  Marchena     1948.0
3       Jordan              6000.0     NaN       NaN        NaN
4         Puma              1000.0     NaN       NaN        NaN
5         Nike              2300.0     NaN       NaN        NaN

57. Reemplazar valores en un DataFrame con la función replace.

In [108]:
df_random['Marca'] = df_random['Marca'].replace({'NewBalance': 'Reebok'})
df_random

         Marca  Cantidad_Empleados    País    Ciudad  Fundacion
0  UnderGround                 NaN  España  Las 3000     1996.0
1       Adidas              1000.0     NaN       NaN        NaN
2       Reebok                 NaN  España  Marchena     1948.0
3       Jordan              6000.0     NaN       NaN        NaN
4         Puma              1000.0     NaN       NaN        NaN
5         Nike              2300.0     NaN       NaN        NaN

58. Remover valores infinitos (-np.inf y np.inf) de un DataFrame con replace.

In [109]:
import numpy as np

df_nuevo.replace([np.inf, -np.inf], np.nan, inplace=True)
df_nuevo

         Marca    País        Ciudad  Fundacion
0         Nike  España  Los Palacios       1964
1       Adidas  España  Lora del rio       1949
2   NewBalance  España      Marchena       1948
3       Jordan  España      Tenerife       1984
4  UnderGround  España      Las 3000       1996

59. Remover las primeras n filas (registros) de un objeto DataFrame usando iloc.

In [110]:
n = 2
df_primeras_filas = df_random.iloc[n:]
df_primeras_filas

    Marca  Cantidad_Empleados    País    Ciudad  Fundacion
2  Reebok                 NaN  España  Marchena     1948.0
3  Jordan              6000.0     NaN       NaN        NaN
4    Puma              1000.0     NaN       NaN        NaN
5    Nike              2300.0     NaN       NaN        NaN

60. Remover las últimas n filas (registros) de un objeto DataFrame usando iloc

In [111]:
df_ultimas_filas = df_random.iloc[:-n]
df_ultimas_filas

         Marca  Cantidad_Empleados    País    Ciudad  Fundacion
0  UnderGround                 NaN  España  Las 3000     1996.0
1       Adidas              1000.0     NaN       NaN        NaN
2       Reebok                 NaN  España  Marchena     1948.0
3       Jordan              6000.0     NaN       NaN        NaN

# Gestión de valores nulos.

61. Seleccionar los registros que tienen un campo nulo (nan) dentro de una columna.

In [112]:
registros_nulos = df_random[df_random.isnull().any(axis=1)]
registros_nulos

         Marca  Cantidad_Empleados    País    Ciudad  Fundacion
0  UnderGround                 NaN  España  Las 3000     1996.0
1       Adidas              1000.0     NaN       NaN        NaN
2       Reebok                 NaN  España  Marchena     1948.0
3       Jordan              6000.0     NaN       NaN        NaN
4         Puma              1000.0     NaN       NaN        NaN
5         Nike              2300.0     NaN       NaN        NaN

62. Contar los elementos que son nulos (NaN) en un objeto DataFrame.

In [113]:
elementos_nulos = df_random.isnull().sum()
print("Cantidad de elementos nulos en cada columna:\n", elementos_nulos)

Cantidad de elementos nulos en cada columna:
 Marca                 0
Cantidad_Empleados    2
País                  4
Ciudad                4
Fundacion             4
dtype: int64

63. Determinar los datos en un DataFrame que son nulos (NaN).

In [114]:
datos_nulos = df_random.isnull()
datos_nulos

   Marca  Cantidad_Empleados   País  Ciudad  Fundacion
0  False                True  False   False      False
1  False               False   True    True       True
2  False                True  False   False      False
3  False               False   True    True       True
4  False               False   True    True       True
5  False               False   True    True       True

64. Encontrar los datos en un DataFrame que no son nulos (NaN).

In [115]:
datos_nonulos = df_random.notnull()
datos_nonulos

   Marca  Cantidad_Empleados   País  Ciudad  Fundacion
0   True               False   True    True       True
1   True                True  False   False      False
2   True               False   True    True       True
3   True                True  False   False      False
4   True                True  False   False      False
5   True                True  False   False      False

65. Reemplazar los NaN (nulo) con un valor específico usando la función fillna.

In [116]:
df_random.fillna(value={'País': 'Desconocido', 'Ciudad': 'Desconocido', 'Fundacion': 0}, inplace=True)
df_random

         Marca  Cantidad_Empleados         País       Ciudad  Fundacion
0  UnderGround                 NaN       España     Las 3000     1996.0
1       Adidas              1000.0  Desconocido  Desconocido        0.0
2       Reebok                 NaN       España     Marchena     1948.0
3       Jordan              6000.0  Desconocido  Desconocido        0.0
4         Puma              1000.0  Desconocido  Desconocido        0.0
5         Nike              2300.0  Desconocido  Desconocido        0.0

# Indexación

66. Ordenar los índices de un DataFrame con la función sort_index.

In [117]:
df_sorted = df_random.sort_index()
df_sorted

         Marca  Cantidad_Empleados         País       Ciudad  Fundacion
0  UnderGround                 NaN       España     Las 3000     1996.0
1       Adidas              1000.0  Desconocido  Desconocido        0.0
2       Reebok                 NaN       España     Marchena     1948.0
3       Jordan              6000.0  Desconocido  Desconocido        0.0
4         Puma              1000.0  Desconocido  Desconocido        0.0
5         Nike              2300.0  Desconocido  Desconocido        0.0

67. Seleccionar una columna de un DataFrame como índice con set_index.

In [118]:
df_newindex = df_random.set_index('Marca')
df_newindex

             Cantidad_Empleados         País       Ciudad  Fundacion
Marca
UnderGround                 NaN       España     Las 3000     1996.0
Adidas                   1000.0  Desconocido  Desconocido        0.0
Reebok                      NaN       España     Marchena     1948.0
Jordan                   6000.0  Desconocido  Desconocido        0.0
Puma                     1000.0  Desconocido  Desconocido        0.0
Nike                     2300.0  Desconocido  Desconocido        0.0

68. Especificar nombres de índices arbitrarios a un objeto DataFrame.

In [119]:
df_indexed_renamed = df_newindex.rename(index={'Puma': 'Index1', 'Jordan': 'Index2', 'Reebok': 'Index3', 'UnderGround': 'Index4', 'Adidas': 'Index5', 'Nike': 'Index6'})
df_indexed_renamed

        Cantidad_Empleados         País       Ciudad  Fundacion
Marca
Index4                 NaN       España     Las 3000     1996.0
Index5              1000.0  Desconocido  Desconocido        0.0
Index3                 NaN       España     Marchena     1948.0
Index2              6000.0  Desconocido  Desconocido        0.0
Index1              1000.0  Desconocido  Desconocido        0.0
Index6              2300.0  Desconocido  Desconocido        0.0

69. Convertir los índices de un DataFrame en una columna con la función reset_index.

In [120]:
df_reset = df_newindex.reset_index()
df_reset

         Marca  Cantidad_Empleados         País       Ciudad  Fundacion
0  UnderGround                 NaN       España     Las 3000     1996.0
1       Adidas              1000.0  Desconocido  Desconocido        0.0
2       Reebok                 NaN       España     Marchena     1948.0
3       Jordan              6000.0  Desconocido  Desconocido        0.0
4         Puma              1000.0  Desconocido  Desconocido        0.0
5         Nike              2300.0  Desconocido  Desconocido        0.0

70. Reiniciar un índice numérico después de eliminar algunos registros con reset_index.

In [121]:
df_reset_index = df_random.reset_index(drop=True)
df_reset_index

         Marca  Cantidad_Empleados         País       Ciudad  Fundacion
0  UnderGround                 NaN       España     Las 3000     1996.0
1       Adidas              1000.0  Desconocido  Desconocido        0.0
2       Reebok                 NaN       España     Marchena     1948.0
3       Jordan              6000.0  Desconocido  Desconocido        0.0
4         Puma              1000.0  Desconocido  Desconocido        0.0
5         Nike              2300.0  Desconocido  Desconocido        0.0

# Ordenación y clasificación

71. Ordenar los valores de las columnas de un DataFrame con sort_values.

In [122]:
df_values = df_random.sort_values(by='Cantidad_Empleados', ascending=False)
df_values

         Marca  Cantidad_Empleados         País       Ciudad  Fundacion
3       Jordan              6000.0  Desconocido  Desconocido        0.0
5         Nike              2300.0  Desconocido  Desconocido        0.0
1       Adidas              1000.0  Desconocido  Desconocido        0.0
4         Puma              1000.0  Desconocido  Desconocido        0.0
0  UnderGround                 NaN       España     Las 3000     1996.0
2       Reebok                 NaN       España     Marchena     1948.0

72. Ordenar los registros de un DataFrame por múltiples columnas.

In [123]:
df_multiple = df_random.sort_values(by=['Cantidad_Empleados', 'Fundacion'], ascending=[False, True])
df_multiple

         Marca  Cantidad_Empleados         País       Ciudad  Fundacion
3       Jordan              6000.0  Desconocido  Desconocido        0.0
5         Nike              2300.0  Desconocido  Desconocido        0.0
1       Adidas              1000.0  Desconocido  Desconocido        0.0
4         Puma              1000.0  Desconocido  Desconocido        0.0
2       Reebok                 NaN       España     Marchena     1948.0
0  UnderGround                 NaN       España     Las 3000     1996.0

# Aplicación de funciones y agrupaciones

73. Realizar consultas sobre los elementos de un objeto DataFrame con la función query.

In [124]:
df_query = df_random.query('Cantidad_Empleados >= 1000')
df_query

    Marca  Cantidad_Empleados         País       Ciudad  Fundacion
1  Adidas              1000.0  Desconocido  Desconocido        0.0
3  Jordan              6000.0  Desconocido  Desconocido        0.0
4    Puma              1000.0  Desconocido  Desconocido        0.0
5    Nike              2300.0  Desconocido  Desconocido        0.0

74. Combinar dos DataFrame y dejar en cada columna el valor mínimo de la suma por columna.

In [125]:
numeric_cols_renamed = df_renamed.select_dtypes(include='number')
numeric_cols_nuevo = df_nuevo.select_dtypes(include='number')

df_combined_min = numeric_cols_renamed.combine(numeric_cols_nuevo, lambda s1, s2: s1.add(s2, fill_value=0).min())
df_combined_min

          Cantidad_Empleados  Fundacion
Empresa1              1000.0     1948.0
Empresa2              1000.0     1948.0
Empresa3              1000.0     1948.0
Empresa4              1000.0     1948.0
0                     1000.0     1948.0
1                     1000.0     1948.0
2                     1000.0     1948.0
3                     1000.0     1948.0
4                     1000.0     1948.0

75. Aplicar una función a todos los elementos de un DataFrame con la función apply.

In [126]:
def to_uppercase(x):
    if isinstance(x, str):
        return x.upper()
    return x

df_uppercase = df_random.applymap(to_uppercase)
df_uppercase

#**

/tmp/ipykernel_2206/3675769154.py:6: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_uppercase = df_random.applymap(to_uppercase)

         Marca  Cantidad_Empleados         País       Ciudad  Fundacion
0  UNDERGROUND                 NaN       ESPAÑA     LAS 3000     1996.0
1       ADIDAS              1000.0  DESCONOCIDO  DESCONOCIDO        0.0
2       REEBOK                 NaN       ESPAÑA     MARCHENA     1948.0
3       JORDAN              6000.0  DESCONOCIDO  DESCONOCIDO        0.0
4         PUMA              1000.0  DESCONOCIDO  DESCONOCIDO        0.0
5         NIKE              2300.0  DESCONOCIDO  DESCONOCIDO        0.0

76.Generar una representación de los elementos de un DataFrame con applymap.

In [127]:
def represent_element(x):
    return f"Value: {x}"

df_representation = df_random.applymap(represent_element)
df_representation

/tmp/ipykernel_2206/3482271462.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_representation = df_random.applymap(represent_element)

,Marca,Cantidad_Empleados,País,Ciudad,Fundacion
0,Value: UnderGround,Value: nan,Value: España,Value: Las 3000,Value: 1996.0
1,Value: Adidas,Value: 1000.0,Value: Desconocido,Value: Desconocido,Value: 0.0
2,Value: Reebok,Value: nan,Value: España,Value: Marchena,Value: 1948.0
3,Value: Jordan,Value: 6000.0,Value: Desconocido,Value: Desconocido,Value: 0.0
4,Value: Puma,Value: 1000.0,Value: Desconocido,Value: Desconocido,Value: 0.0
5,Value: Nike,Value: 2300.0,Value: Desconocido,Value: Desconocido,Value: 0.0

77. Reemplazar valores de una columna con la función map de un DataFrame.

In [128]:
mapeo = {'Nike': 'Nike Inc.', 'Adidas': 'Adidas AG', 'Puma': 'Puma SE', 'Jordan': 'Jordan Brand'}

df_random['Marca'] = df_random['Marca'].map(mapeo)
df_random

          Marca  Cantidad_Empleados         País       Ciudad  Fundacion
0           NaN                 NaN       España     Las 3000     1996.0
1     Adidas AG              1000.0  Desconocido  Desconocido        0.0
2           NaN                 NaN       España     Marchena     1948.0
3  Jordan Brand              6000.0  Desconocido  Desconocido        0.0
4       Puma SE              1000.0  Desconocido  Desconocido        0.0
5     Nike Inc.              2300.0  Desconocido  Desconocido        0.0

78.Usar groupby para agrupar datos por una columna específica y contar la cantidad de elementos.

In [129]:
grouped_data = df_random.groupby('Marca').size()
grouped_data

Marca
Adidas AG       1
Jordan Brand    1
Nike Inc.       1
Puma SE         1
dtype: int64

79. Usar la función agg para realizar varias operaciones por un eje de un DataFrame.

In [130]:
agg_operations = df_random.agg({
    'Cantidad_Empleados': ['sum', 'mean', 'max', 'min'],
    'Fundacion': ['max', 'min']
})

agg_operations

      Cantidad_Empleados  Fundacion
sum              10300.0        NaN
mean              2575.0        NaN
max               6000.0     1996.0
min               1000.0        0.0

80. Eliminar registros que no cumplan con una condición sobre una columna específica.

In [131]:
df_filtered = df_random[df_random['Cantidad_Empleados'] >= 2000]
df_filtered

          Marca  Cantidad_Empleados         País       Ciudad  Fundacion
3  Jordan Brand              6000.0  Desconocido  Desconocido        0.0
5     Nike Inc.              2300.0  Desconocido  Desconocido        0.0

81. Agrupar un conjunto de datos y luego calcular su promedio con groupby y mean.

In [132]:
df_grouped_mean = df_random.groupby('Marca').mean(numeric_only=True)
df_grouped_mean

              Cantidad_Empleados  Fundacion
Marca
Adidas AG                 1000.0        0.0
Jordan Brand              6000.0        0.0
Nike Inc.                 2300.0        0.0
Puma SE                   1000.0        0.0

82. Usar las funciones all y any sobre un objeto DataFrame.

In [133]:
todos_mayores_1000 = df_random['Cantidad_Empleados'].gt(1000).all()
print("Todos los valores en Cantidad_Empleados son mayores que 1000:", todos_mayores_1000)

alguno_mayor_1000 = df_random['Cantidad_Empleados'].gt(1000).any()
print("Algún valor en Cantidad_Empleados es mayor que 1000:", alguno_mayor_1000)

Todos los valores en Cantidad_Empleados son mayores que 1000: False
Algún valor en Cantidad_Empleados es mayor que 1000: True

83. Calcular el elemento mayor por cada fila y columna con la función max.

In [134]:
numeric_cols = df_random.select_dtypes(include=[np.number])

max_per_column = numeric_cols.max()

max_per_row = numeric_cols.max(axis=1)

print("Máximo por columna:\n", max_per_column)
print("Máximo por fila:\n", max_per_row)

Máximo por columna:
 Cantidad_Empleados    6000.0
Fundacion             1996.0
dtype: float64
Máximo por fila:
 0    1996.0
1    1000.0
2    1948.0
3    6000.0
4    1000.0
5    2300.0
dtype: float64

84. Calcular el promedio y la mediana por cada fila y columna con mean y median.

In [135]:
mean_per_column = df_random.mean(numeric_only=True)
print("Promedio por columna:\n", mean_per_column)

median_per_column = df_random.median(numeric_only=True)
print("Mediana por columna:\n", median_per_column)

mean_per_row = df_random.mean(axis=1, numeric_only=True)
print("Promedio por fila:\n", mean_per_row)

median_per_row = df_random.median(axis=1, numeric_only=True)
print("Mediana por fila:\n", median_per_row)

Promedio por columna:
 Cantidad_Empleados    2575.000000
Fundacion              657.333333
dtype: float64
Mediana por columna:
 Cantidad_Empleados    1650.0
Fundacion                0.0
dtype: float64
Promedio por fila:
 0    1996.0
1     500.0
2    1948.0
3    3000.0
4     500.0
5    1150.0
dtype: float64
Mediana por fila:
 0    1996.0
1     500.0
2    1948.0
3    3000.0
4     500.0
5    1150.0
dtype: float64

85. Calcular el elemento menor por cada fila y columna con la función min.

In [ ]:
min_per_column = df_nuevo.min(numeric_only=True)
min_per_row = df_nuevo.min(axis=1, numeric_only=True)

print("Mínimo por columna:\n", min_per_column)
print("Mínimo por fila:\n", min_per_row)

Mínimo por columna:
 Fundacion    1948
dtype: int64
Mínimo por fila:
 0    1964
1    1949
2    1948
3    1984
4    1996
dtype: int64

In [140]:
df_nuevo

         Marca    País        Ciudad  Fundacion
0         Nike  España  Los Palacios       1964
1       Adidas  España  Lora del rio       1949
2   NewBalance  España      Marchena       1948
3       Jordan  España      Tenerife       1984
4  UnderGround  España      Las 3000       1996

86. Redondear valores reales con la función DataFrame.round.

In [ ]:
df_redondear = pd.DataFrame({
    'A': [1.12345, 2.67891, 3.14159, 4.98765],
    'B': [5.54321, 6.87654, 7.12345, 8.98765]
})

df_redondear = df_redondear.round(2)
df_redondear

      A     B
0  1.12  5.54
1  2.68  6.88
2  3.14  7.12
3  4.99  8.99

87. Sumar los valores de una columna de un DataFrame con sum.

In [150]:
suma_cantidad_empleados = df_redondear['B'].sum()
print("Suma de la columna B:", suma_cantidad_empleados)

Suma de la columna B: 28.53

88. Calcular el promedio de los valores de una columna de un DataFrame.

In [151]:
promedio_columna_B = df_redondear['B'].mean()
print("Promedio de la columna B:", promedio_columna_B)

Promedio de la columna B: 7.1325

89. Calcular el módulo sobre cada elemento de un objeto DataFrame numérico (una matriz).

In [152]:
df_modulo = df_redondear.mod(2)
df_modulo

      A     B
0  1.12  1.54
1  0.68  0.88
2  1.14  1.12
3  0.99  0.99

90. Calcular el producto punto entre dos objetos DataFrame con la función dot.

In [ ]:
df1 = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

df2 = pd.DataFrame({
    'A': [7, 8, 15],
    'B': [9, 10, 20],
    'C': [11, 12, 50]
})

producto_punto = df1.dot(df2.T)
producto_punto

     0    1    2
0  120  132  445
1  147  162  530
2  174  192  615

91. Calcular la transpuesta de un objeto DataFrame con transpose o T.

In [ ]:
df_transposed = df_redondear.transpose()
df_transposed

      0     1     2     3
A  1.12  2.68  3.14  4.99
B  5.54  6.88  7.12  8.99

92. Usar operadores relacionales para comparar elementos de objetos DataFrame.

In [164]:
data = {
    'A': [10, 20, 30, 40, 50],
    'B': [5, 15, 25, 35, 45]
}
dfej92 = pd.DataFrame(data)

comparacion_mayor = dfej92 > 20
comparacion_igual = dfej92 == 30

print("Comparación mayor que 20:\n", comparacion_mayor)
print("Comparación igual a 30:\n", comparacion_igual)

Comparación mayor que 20:
        A      B
0  False  False
1  False  False
2   True   True
3   True   True
4   True   True
Comparación igual a 30:
        A      B
0  False  False
1  False  False
2   True  False
3  False  False
4  False  False

93. Verificar con equals si dos objetos DataFrame contienen los mismos elementos.

In [165]:
df1.equals(df2)

False